---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.ExtensibleStorage.DataStorage
source: html/f61c98da-79ec-7cd4-0979-2913d6ed739f.htm
---
# DataStorage Members

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.